---
kind: property
id: P:Autodesk.Revit.DB.SymbolTypeId.KNPerM
source: html/efccdf01-d5dc-e480-b3f4-8ca783c5f49d.htm
---
# Autodesk.Revit.DB.SymbolTypeId.KNPerM Property

Symbol kN/m, indicating unit Kilonewtons per meter.

## Syntax (C#)
```csharp
public static ForgeTypeId KNPerM { get; }
```